# Terminal & Shell
cask "ghostty"
brew "starship"
brew "zsh-autosuggestions"
brew "fzf"

# Git
brew "git"
brew "git-delta"
brew "gh"
brew "lazygit"

# CLI Tools
brew "ripgrep"
brew "bat"
brew "eza"
brew "yq"
brew "fd"
brew "tree"

# Editor
brew "neovim"

# Session Manager
brew "tmux"

# Version Manager
brew "mise"

# Python
brew "uv"

# Development - React Native / Expo
brew "watchman"

# Container
cask "orbstack"

# Font
cask "font-jetbrains-mono-nerd-font"

# Apps
cask "rectangle"
cask "1password"
cask "1password-cli"

# Network
cask "tailscale-app"

# Mac App Store
brew "mas"
mas "Xcode", id: 497799835
mas "Slack", id: 803453959
mas "KakaoTalk", id: 869223134
