cask_args appdir: '/Applications'

brew 'tree'
brew 'eza'
brew 'pnpm'
brew 'ripgrep'
brew 'fd'
brew 'asdf'
brew 'starship'
brew 'nushell'
brew 'fzf'
brew 'jq'
brew 'zinit'
brew 'bat'
brew 'yq'
brew 'commitizen'
brew 'direnv'

cask 'iterm2'
cask 'visual-studio-code'
cask 'rectangle'
cask 'font-jetbrains-mono-nerd-font'

mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas 'KakakoTalk', id: 869223134
