cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-fonts'
tap 'pulumi/tap'

brew 'argocd'
brew 'neovim'
brew 'kustomize'
brew 'helm'
brew 'eksctl'
brew 'tree'
brew 'python'
brew 'node'
brew 'tldr'
brew 'exa'
brew 'oha'
brew 'mysql'
brew 'mysql-client'
brew 'pnpm'
brew 'vercel-cli'
brew 'ripgrep'
brew 'fd'
brew 'dog'
brew 'go'
brew 'gnu-sed'
brew 'asdf'
brew 'choose-rust'
brew 'starship'
brew 'nushell'
brew 'fzf'
brew 'jq'
brew 'zinit'
brew 'bat'
brew 'yq'
brew 'kubernetes-cli'
brew 'awscli'
brew 'pulumi'
brew 'commitizen'
brew 'lua'
brew 'direnv'
brew 'k9s'

cask 'tailscale'
cask '1password'
cask 'iterm2'
cask 'docker'
cask 'visual-studio-code'
cask 'rectangle'
cask 'keybase'
cask 'font-jetbrains-mono-nerd-font'

mas 'Xcode', id: 497799835
mas 'Slack', id: 803453959
mas 'KakakoTalk', id: 869223134
